{"posts":[{"title":"上海、杭州游记","text":"前言旅行的意义是什么？我是说，在技术无所不能的前夕，互联网可以找到远比个人旅行能获取的更多信息，纪念品可以在网络上购到，占据大多数人旅行之大部分的人景合照可以由ps技术得到或ai生成。虽然我也同意目前技术还做不到完美，但倘若——我们就作这样的假设：技术若真发展到完美的地步，那么旅行的意义还余下些什么？毕竟大多数人的旅行基本只有拍照、品尝与观景。 有一个颇有哲学含义的定理这样是说的（米田嵌入），$A\\cong B\\Leftrightarrow \\mathrm{Hom}(-, A)\\cong\\mathrm{Hom}(-, B)$。我想开始用感性的语言去解释这样的定理，在以往我可能会反对自己这种做法，但现在我的思想有了变化。 我们不妨把这叫作米田信夫的哲学：一件事物之完整内涵无外乎对其一切的感知。风是客观存在的事物，而我走出图书馆，感受到了面颊的吹拂，便知道了风的存在；我看到树的摇曳，便知道了风的方向；如果我还恰好站在老家的麦田中，那风便拥有了形状……如果有人能穷尽一切的途径去观察这风，那他不多不少正好可以还原这风的整个面貌。 上海上海是我一直想去的地方之一，但是并没有一个很明确的原因，因为我并不喜欢过于繁华的街道。三年前如果有人问我在静谧的乡村和繁华的城市之间选择一个作为居住地，我会毫不犹豫地选择乡村。一方面是受父母辈的影响，我的父母都来自农村，而且多次与我谈到退休后的生活，他们都更想翻修农村的老房子后在那边生活。我从小几乎没出过省，甚至连学校所在的县都没怎么出过，整个人生轨迹就是从遂宁迁出后在罗江县城学校附近、金山镇口与成都的住处辗转，就仿佛我高中那三点一线的日常放大版，扩大到以年为单位的人生而已。因此我便凭着一些猜测加模糊的印象，认为乡村的生活应该更合乎我的口味。直到最近我才开始质疑起自己，真的是这样吗？ 我非常喜欢一款游戏《镜之边缘》，小时候电脑配置不够，只能玩一代，二代根本启动不了，只能在视频网站上看宣传片和实况过过瘾。后来放假时到姨夫家中蹭电脑玩，他们家的电脑配置稍微好一点，我开着最低的画质和分辨率玩了一部分剧情，收假后还回味无穷。我永远忘不了一代结束时摄像机抬起后伴随《Still Alive》展开的镜之城夜景，当时不知道怎的就触动了我的神经，下面许多楼房都是之前关卡所在，现在想来，正是那种面对着由海量与自己相关的细节组成的世界。后来寻遍天下游戏，几乎找不到第二款能给我同样感觉的游戏。后来上大学换了电脑，终于能正常游玩催化剂，我是买下来后反复把玩，一款半成品几乎没有实质的开放世界的单机游戏能玩上两三百小时，这在我其他游戏时间中实属罕见。 这次来到上海，回想起游戏中那个令我无法忘怀的镜头，虽然知道东方明珠人多得骇人，我还是执意跟同伴说想上去看看。幸好同伴也没有多抱怨，到地方就开始排队，后来排了快三个小时才终于登上塔顶，尽管天气也很炎热，同伴却也没说什么（旅行选好同伴真的很重要，换作别人估计要吵架了）。我在塔上转了若干圈，因为手机摄像头不好，让同伴帮着拍了几张俯瞰图，算是了了童年的一桩心愿。又去上面几层的玻璃栈道看了一下，可惜玻璃已经脏得看不清下方，只有模糊的光圈，不到一小时便又下了来。 我在东方明珠上亲眼看到了屡次出现在我梦中的繁华，晚上躺在床上，却总觉和我的期待略有偏差。辗转反侧思来想去，认为是上海这种至极的繁华和我距离太遥远了，不像是我的生活，或者与我能有联系。有时候梦想照进现实，才发现这多年梦想不是自己想要的。 后来几天还去了爱情公寓的外景取景地，拍了照片，算是打了卡，不过打卡并未给我留下什么特殊的印象，看来有些感动只适合存在自己的脑海里。 杭州这次出游，杭州给了我莫大的惊喜。本来杭州对这次旅行来说只是一个中转地，从上海到德清比赛回来，到杭州比较近，机票也较便宜而已。杭州的美食极其难吃，尤其是最出名的几样：醋鱼、东坡肉等，令人很失望，这段就不再写了。 最令我惊讶的是城市阳台这里。我在这里找到了东方明珠上缺失的那块感觉. 杭州是一个同样繁华的城市，但在城市阳台与对岸隔江相望，却给了我在上海无论如何也找不到的安心感。虽然东方明珠与外滩也有一江之隔，但两岸都太喧闹，甚至珠江水面都难得平静。而钱塘江的静谧却巧妙地嵌入到两岸的繁华中，中间的大桥像两条波涛汹涌的大河间的涓涓细流，沟通着两边的繁忙和成千上万的故事。 我当晚在城市阳台上站了很久，用我的手机也好同伴的手机也好，无论如何也拍不出我当时心头的激动，在我看来，这完全就是我在催化剂的夜晚获得的情感的翻版，一点不差。 城市阳台的人并不多，我可以随意在附近走动和驻足，不像外滩需要见缝插针地找角度拍照。我有一瞬间感觉这就是我想定居的区域，这个意境，就是我前十余年日有所思，夜有所梦所苦苦寻找的！只有这时才真正体会到书到用时方恨少，词不达意之人的悲哀！ 当然，我以后是否在这边定居还是未知数，杭州的美食太过难吃，而且离四川确实也比较远。这些都是后话了。 此外，我希望这世上再也不要有人吃到西湖醋鱼！！！这是前二十一年经过我胃的最难吃的菜。","link":"/2024/08/28/%E4%B8%8A%E6%B5%B7%E3%80%81%E6%9D%AD%E5%B7%9E%E6%B8%B8%E8%AE%B0/"},{"title":"做一首世俗的诗","text":"距离上一次写博客已经过去近两年，说是写博客，当时更接近探索博客的各种主题，而实质的内容却没有。最近手头琐事终于告一段落，得来数月的空闲，遂想起重拾这段经历，想来自己这几年不缺乏经历，却缺了记录。 有一句话我的印象很深刻：If you can’t be a poet, be a poem. 我为自己的研究生方向选择了基础数学，而且是一个在基础数学中都算冷门的方向，有时候难免在夜不能寐时反问自己是否把路走太窄了。我一直深知自己在数学方面实在没太多天赋，仅凭年轻的热血就铁着头走到现在，虽还没撞到南墙，却时不时觉着前方有一堵障碍，我始终活在它的阴影之下，不知何时会碰上。 做数学就是写诗，这毫无疑问，无论是调侃为竞赛命题学的数学，还是做前沿的数学，都是在写一首首晦涩的诗，但我本科以来就很少体会到自己谱诗的乐趣，常常是对着一道命题作文无从下手，最后只得欣赏别人的作品。是否能顺利毕业呢，毕业后又何去何从，这些我都不敢去考虑，作为没有天赋的人走这条路，注定是付出比别人更多的努力，最后拿着比同龄人普遍低的薪水。但是话又说回来，我失眠的夜晚，往往是困在更广阔的生与死的问题，那么既然人只能活这一辈子，还不去追求自己的理想，稀里糊涂地赶路，岂不悲哉？一位老师讲过，一人所爱和所长重叠，实在是可遇不可求之事，对于大多数人来说，所爱与所长，总要做出选择。所以既然我注定成不了诗人，那么我暂时选择成为一首诗。 回想这本科这三年的经历，我有一段时间像个中二少年一样，将自己伪装成沉浸在数学中的角色，对周遭的一切漠不关心，仿佛性冷淡。但逐渐的才意识到自己正值而立之年，却整日在泡影一样的世界中，错过了世界的太多美好，我又想到每天摸鱼学几个法语单词的日子里看到的一句话：La vérité ne se trouve d’ailleurs pas dans les livres, mais dans la vie. 真相不在书中，而在生活里。如果错过生活里的细节，那对自己灵魂的理解往往只存在自己大脑编造的幻象里，正如同学生没处在阶级斗争之正中，那对阶级斗争的理解也只存在幻想中，终日只会在网络上打键盘而已。 别人问我喜欢在乡村还是城市呢，一年前我将毫不犹豫地选择乡村，因为哪怕小时候在农村长大，我也没干过农活，于是总只是在幻想乡村中静谧平淡的日子，幻想自己喜欢一个人独居。但走过了更多地方后，我才明白自己其实离不开城市的喧嚣，我喜欢独处，但喜欢的是将自己置身在人群、车海中的孤独，喜欢将自己淹没在海量的故事与细节中，就像摩天大楼随机一层楼晚上的一盏灯，然后才终于明白小时候喜欢的一些游戏为何吸引我。所以我才说，想做一首世俗的诗。我做不到那些数学大师一样的超然世外，我离不开世俗的景色。","link":"/2024/07/12/%E5%81%9A%E4%B8%80%E9%A6%96%E4%B8%96%E4%BF%97%E7%9A%84%E8%AF%97/"},{"title":"DisCoCat粗览","text":"DisCoCat(Categorical Compositional Distributional Semantics)是一种使用范畴论来为自然语言提供语义解释的模型，我的导师让我阅读相关的文献做一个综述，作为我的本科毕业论文。我此前对NLP基本一无所知，所以我感觉这对我可能算是一个比较大的挑战，这也是我第一次认真进行科研活动，希望能做得尽量好。我目前粗读了几篇文章，感觉这个模型虽然实用性不大，但能将范畴论用在这个方面也算有点意思，所以打算开个文章简单介绍一下它，也算对我的思路做个梳理。 语法——Pregroup Grammar我们首先需要一个重要的概念：预群（Pregroup）。一个预群是一个偏序集且是幺半群$(G,\\cdot,1)$，满足每个元素$x$都有左、右伴随$x^r,x^l$，使得$$\\begin{cases} xx^r\\le1,\\\\ x^lx\\le1,\\\\ x^rx\\ge1,\\\\ xx^l\\ge1\\end{cases}$$ 1999年，Lambek首先提出了Pregroup grammar[1]，这是一种将自然语言的语法编码成一种有伴随结构的偏序集的方法，主要思想是这样的：在一个自然语言中，有着一些基础类型（Type），构成一个集合（或者偏序集）$B$，然后用$B$去自由生成一个Pregroup $\\mathscr{P}(B)$。随即在这个结构里指定一个特殊的类型$s$，称作句类型（sentence type）。我们然后为这个自然语言的每个单词$w$指定一个类型$T\\in\\mathscr P(B)$。在这些操作之后，一个句子作为一串单词的组合$w_1…w_n$，就自然拥有一个类型$T_1…T_n$，假如$T_1…T_n\\le s$，我们就认为这个句子符合语法（grammatical）。基于$B$中的基本序关系和预群公理的将复合类型$T$不断消去为$1$的过程称为类型推导（Type reduction） 总结来说，一个Pregroup grammar就是一个四元组$G=(B,\\Sigma,\\Delta,s)$，其中，$B$表示基础类型的集合（偏序集），$\\Sigma$表示词汇表，即所有的单词，$\\Delta\\subset\\Sigma\\times\\mathscr P(B)$是一个关系，称作字典，也就是为单词分配类型，最后$s\\in\\mathscr P(B)$表示句类型。 但是敏锐的人可以发现，依赖自由预群的方法有一个明显的缺陷：即无法区分同一句子的不同的类型推导。举个简单的例子：men and women whom I liked. 这句话明显是有两种意思，根据whom的修饰对象确定，也就是说它有两种可能的语法结构，Pregroup grammar必须要对此作出区分。 假设以下基本类型：$\\pi_1,\\pi,s_2,s,p$以及偏序关系$s_2\\to s,\\pi_1\\to\\pi$，并为单词分配合适的类型（这里省略）。则以上例句的语法正确性由下式保证： $pp^r \\quad p \\quad p^lpp^rp \\quad o^lls^lπ_1π^r \\quad s_2 \\quad o^l \\to p$ 而如果仔细检查语法推导过程，可以发现存在两种推导方法（我用括号标出关键不同之处），这似乎对应了两种语法结构。 $pp^r \\quad p \\quad p^l(pp^r)p \\quad o^lls^lπ_1π^r \\quad s_2 \\quad o^l \\to p$ $pp^r \\quad p \\quad (p^lp)p^rp \\quad o^lls^lπ_1π^r \\quad s_2 \\quad o^l \\to p$ 可惜在自由预群的视角下，推导过程并不重要，只有大小关系而已。后来（2010年之后）Anne Preller提出应当使用自由刚性范畴代替自由预群[2]。这是非常天才且关键的观察，根据她的具体构造方法，不同的推导过程天然地被区分开了。 语义——Semantics有了这做基础，我们可以继续为Pregroup grammar赋予语义。2010年时，Bob Coecke使用$\\mathscr P(B)\\times\\mathbf{FVect}_\\mathbb{R}$这个范畴为一个句子赋予语义[3]，他的方法后来被称为Product Space Representation。 但结合后来者的工作，这种表示方式实在有些不自然。现在常用的赋予语义的方法是首先给定一个预群语法$G$，我们作一个词汇范畴（Lexical category）$\\mathscr L(G)$来同时编码语法与词汇（作法后面详说），然后选定一个语义范畴（Semantic category），通常的选择是$\\mathbf{FVect}_\\mathbb{R}$。于是乎，只要给出一个强幺半函子（还要求保持所有刚性结构，注意$\\mathbf{FVect}_\\mathbb{R}$也是刚性的，只是左右伴随相等），我们基本上就做到了把单词的语义组合为句子的语义。 虽然Preller最初给出的是对任何一个范畴自由生成刚性范畴的方法，但我们需要的并不是此，而是Antonin Delpeuch（这位老哥现在已经离开学术界多年了）在2014年提出的幺半范畴的自守化[4]，基本思想差不多，但后者对幺半范畴做，且使得生成的范畴的幺半结构保持为原本的。 词汇范畴的构造简要来说是先对偏序集$\\mathscr{P}(B)$作范畴化，将此范畴幺半化，然后根据字典$\\Delta$往其中添加所谓的Lexical morphisms（但实际上刚才定义的字典是不够的，我与曾经在此领域工作的一位学者讨论了一下，他认为lexical morphisms are beyond the lexicon，也就是说我们需要假设更多的信息），最后对得到的幺半范畴作自守化。 其实，是否需要自守化，取决于模型的复杂程度。如果我们的语法中每个词对应的lexical morphism仅仅是基本类型间的箭头，那我们根本不需要自守化：自由刚性范畴就够了。这也解释了为什么有些文献中meaning morphism也可以用正规图来表示，而有些文献中meaning morphism却很复杂，不是正规的图表示。 Product space representation先不使用词汇范畴的概念，传统的做法是这样的：首先对$\\mathscr P(B)$自由生成一个刚性范畴得到语法范畴$\\mathscr C(B)$。然后选定一个语义范畴，这里用$\\mathbf{FVect}_\\mathbb{R}$来做示范。考虑乘积范畴$\\mathscr C(B)\\times \\mathbf{FVect}_\\mathbb{R}$，然后为每个基本类型$T$取定一个对应的线性空间$N_T$，而词汇$w$本身是一些通过分布式语义的方法得到的词向量$\\vec w$，它们存在于对应类型对应的空间中。现在任意给一个句子$p=w_1…w_n$，为了得到句子的词向量$\\vec p\\in N_s$，我们： 为每个词$w_i$确定一个类型$T_i$ 在范畴$\\mathscr C(B)$中确定一个type reduction$f:T_1…T_n\\to s$，对应地，选择一个线性映射$g:N_1\\otimes…\\otimes N_n\\to N_s$ 计算$g(\\vec{w_1}\\otimes…\\otimes\\vec{w_n})=\\vec p$ PS revisited我已经提到，虽然现在人们常用强幺半函子来表示语义，但这个模型需要假设比一个经典预群语法更多的信息。那么，如果我们有一个函子模型，能不能还原出一个PS模型（乘积空间）呢？答案是能[5]，但需要一些范畴论的办法。简单介绍如下： From Sentences to Discourses以上，我们只能把单词的含义通过语法结构组合为单独句子的语义，但实际文本中，句子之间是有着必然联系的。有人试着向这个方向探索。 思想实验本来想给这节起名为应用场景的，但就我目前看到的文献来说，很难说DisCoCat有什么有价值的实际应用。大部分相关文章本质上都是在做思想实验，涉及到的例子都是极小规模的，比如只有两三个基本类型，包括至多四五个单词，词的类型都是人为规定，而语句都是简单的如SVO型句子，而词的含义也处在简单的一二维向量空间中。按理来说如果想将这个模型应用到实际中，必须使用机器学习算法从大量文本中提取字典和词义，词义应当处在一些相当大维数的空间中。目前似乎也有人做了这样的实践，Alexis Toumi开发的DisCoPy。 1.Lambek, J. Pregroup Grammars and Chomsky’s Earliest Examples. J of Log Lang and Inf 17, 141–160 (2008). https://doi.org/10.1007/s10849-007-9053-2 ↩2.Preller, Anne &amp; Lambek, Joachim. (2007). Free Compact 2-Categories. Mathematical Structures in Computer Science. 17. 10.1017/S0960129506005901. ↩3.Coecke, Bob &amp; Sadrzadeh, Mehrnoosh &amp; Clark, Stephen. (2010). Mathematical Foundations for a Compositional Distributional Model of Meaning. Lambek Festschrift Linguistic Analysis. 36. ↩4.Delpeuch, Antonin. (2014). Autonomization of Monoidal Categories. ↩5.Bradley, Tai-Danae &amp; Lewis, Martha &amp; Master, Jade &amp; Theilman, Brad. (2018). Translating and Evolving: Towards a Model of Language Change in DisCoCat. Electronic Proceedings in Theoretical Computer Science. 283. 50-61. 10.4204/EPTCS.283.4. ↩","link":"/2024/11/03/DisCoCat%E7%B2%97%E8%A7%88/"},{"title":"Munkres Topology Solution: Chapter 5","text":"§37. Tychonoff TheoremEx.37.1 Let $X$ be a space. Let $\\mathscr D$ be a collection of subsets of $X$ that is maximal with respect to the finite intersection property.(a) Show that $x\\in \\bar D$ for every $D\\in\\mathscr D$ iff every nbhd of $x$ belongs to $\\mathscr D$. Which implication uses maximality of $\\mathscr D$?(b) Let $D\\in\\mathscr D$. Show that if $A\\supset D$, then $A\\in\\mathscr D$(c) Show that if $X$ satisfies the $T_1$ axiom, there is at most one point belonging to $\\bigcap_{D\\in\\mathscr D}\\bar D$ (a) This is equivalent to saying that $x\\in\\bigcap_{D\\in\\mathscr D}\\bar D\\iff\\mathcal N(x)\\subset\\mathscr D$. If $x\\in\\bigcap_{D\\in\\mathscr D}\\bar D$, i.e. $\\forall D\\in\\mathscr D, x\\in\\bar D$. Then $\\forall U\\in\\mathcal N(x), U\\cap D\\neq\\empty$. By maximality of $\\mathscr D$, we have $U\\in\\mathscr D$. Thus we have proven $\\mathcal N(x)\\subset\\mathscr D$. Conversely, suppose $\\mathcal N(x)\\subset\\mathscr D$, using finite intersection property of $\\mathscr D$, we know that $\\forall U\\in\\mathcal N(x)\\subset\\mathscr D, D\\in\\mathscr D, U\\cap D\\neq\\empty$, which means exactly that $x\\in\\bar D$. (b) Let $\\mathscr D’=\\mathscr D\\cup{A}$, any finite intersection within $\\mathscr D’$ is either a finite intersection within $\\mathscr D$ (hence nonempty) or a finite intersection within $\\mathscr D$ with $A$: $A\\cap D_1\\cap…\\cap D_n$. Note that $A\\cap D_1\\cap…\\cap D_n\\supset D\\cap D_1\\cap…\\cap D_n$, the right side of which is a finite intersection within $\\mathscr D$, again nonempty. (c) THIS IS FALSE. $T_2$ is necessary for (c). A counterexample can be found here Suppose there are $x\\neq y\\in\\bigcap_{D\\in\\mathscr D}\\bar D$, by (a) this means $\\mathcal N(x),\\mathcal N(y)\\subset\\mathscr D$. Use Hausdorff-ness we get disjoint open sets $U\\in\\mathcal N(x), V\\in\\mathcal N(x)$, which contradicts to finite intersection property of $\\mathscr D$.","link":"/2024/11/27/Munkres-Topology-Solution-Chapter-5/"},{"title":"Munkres Topology Solution: Preface","text":"Munkres拓扑是最经典的点集拓扑教材，但奇怪的是网络上只能找到前四章的解答，至于第五到八章，则没有系统完整的解答，只有MSE等论坛上有分散的问答，查起来有些麻烦。我想在空闲时间把自己这学期写的解答放出来，为后来者学习提供方便。考虑到Munkres这本书的受众，我尽量用英文写解答。 我目前只打算写第五到八章的习题解答，第九章之后是代数拓扑的内容，我不会使用这本书来学代数拓扑，大多数人也不会这样做。至于第一到四章，可以参考Vadim的博客，这上面有非常详细的解答，评论区也有适当的讨论或勘误。 对于解答，我再作一些说明： 过于简单的题目我可能会跳过。比如检查正文中的例子的细节或直接的验证定义等。 很复杂或深刻著名的结论我会尽量说明证明的动机，以及额外补充一些反例。 如果有些解答中有些过于繁琐的细节，我可能也会略去，如果可能，我会提供MSE链接。 Munkres不是圣经，有些题目其实是错的，我会在对应的地方注明这点。","link":"/2024/11/27/Munkres-Topology-Solution-Preface/"}],"tags":[{"name":"杂谈","slug":"杂谈","link":"/tags/%E6%9D%82%E8%B0%88/"},{"name":"旅行","slug":"旅行","link":"/tags/%E6%97%85%E8%A1%8C/"},{"name":"随记","slug":"随记","link":"/tags/%E9%9A%8F%E8%AE%B0/"},{"name":"应用范畴论","slug":"应用范畴论","link":"/tags/%E5%BA%94%E7%94%A8%E8%8C%83%E7%95%B4%E8%AE%BA/"},{"name":"一般拓扑","slug":"一般拓扑","link":"/tags/%E4%B8%80%E8%88%AC%E6%8B%93%E6%89%91/"},{"name":"解答","slug":"解答","link":"/tags/%E8%A7%A3%E7%AD%94/"}],"categories":[{"name":"Munkres Topology Solution","slug":"Munkres-Topology-Solution","link":"/categories/Munkres-Topology-Solution/"}],"pages":[{"title":"关于我","text":"你好呀，我叫杨荻，出生于中国四川省遂宁市。我目前就读于四川大学数学学院，拟录取为四川大学数学学院直博生，研究方向为拓扑学与范畴论。我当前对应用范畴论比较感兴趣，欢迎与我交流相关话题！ 我同时也是一名业余魔方爱好者，WCAID为2023YANG65。欢迎魔友一起学习进步。 我爱好旅行，但是目前并没有财力和时间去旅行TAT，只能空闲时间打打游戏。我常玩的游戏：战地系列（Battlefield 3, 1, 5, 2042, …）、镜之边缘系列、消逝的光芒系列、星际公民和Minecraft等","link":"/about/index.html"}]}